xmlsamples/PI_Pricing/KR-FI-BIS-KRAP1EWT001A.xml

<soapenv:Envelope xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:esp-fee-inquiry-request>
         <partner>
            <id>WGBSKRAP10T</id>
            <system>
               <id>WGBSKRAP10T</id>
               <name>Demo</name>
               <version>9101</version>
               <ip_address>172.31.19.212</ip_address>
               <connector>
                  <id>KRAP1EWT001A</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>BM</id>
            <type>DMAMOB</type>
         </device>
         <external_reference_no>20240419151553978</external_reference_no>
         <sender>
            <name>
               <first_name>Donghyeon</first_name>
               <last_name>Kim</last_name>
            </name>
            <address>
               <addr_line1>######################################################</addr_line1>
               <city>Gyeonggi-do</city>
               <country_iso_code>KR</country_iso_code>
               <country_code>
                  <iso_code>
                     <country_code>KR</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
                  <country_name>South Korea</country_name>
               </country_code>
            </address>
            <bank_account>
               <account_number>94290201272960</account_number>
            </bank_account>
         </sender>
         <receiver>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>PH</country_code>
                     <currency_code>PHP</currency_code>
                  </iso_code>
               </country_code>
            </address>
         </receiver>
         <transaction_type>WMF</transaction_type>
         <payment_details>
            <origination>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>KR</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>96500</expected_payout_amount>
               <currency_iso_code>PHP</currency_iso_code>
               <country_iso_code>PH</country_iso_code>
            </destination>
         </payment_details>
      </xrsi:esp-fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>